ams/src/Documents/AMS_ЛогистическийЛист/AMS_ЛогистическийЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ЛогистическийЛист</name>
  <registerRecords>InformationRegister._Рейсы</registerRecords>
  <registerRecords>InformationRegister._РейсыРаспоряжения</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаВодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАгента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузкиФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВМаршруте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединеннаяЗагрузка</name>
      <type>
        <types>DocumentRef.AMS_ОбъединеннаяЗагрузка</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.AMS_ПередачаВПереработку</types>
        <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАдресаДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЧек</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНарушениеДоговора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПретензия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подвоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтменыДоставки</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>EnumRef._ПричиныОтменыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратыТоваров</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>EnumRef._ПричиныОтменыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияЗаказа</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подвоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/AMS_ИсторияРеализации/AMS_ИсторияРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_ИсторияРеализации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.AMS_СобытияРеализации</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <types>EnumRef.AMS_СтатусыРеализаций</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийЛист</name>
    <type>
      <types>DocumentRef.AMS_ЛогистическийЛист</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Documents/AMS_ЛогистическийЛист/Forms/ФормаПечать/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();

	ЗаполнитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	Состояние("Вывод документов на печать...");


	Для Каждого Стр Из ТаблицаДокументов Цикл
		Если Не (Стр.Метка И Стр.УтвержденаОтгрузка) Тогда
			Продолжить;
		КонецЕсли;

		МассивОбъектов = Новый Массив; МассивОбъектов.Добавить(Стр.Реализация);

//		Если СписокРеализаций.НайтиПоЗначению(Стр.Реализация) = Неопределено Тогда
//			// Складская накладная из Реализация			
//			ТабличныйДокумент = СкладскаяНакладная(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, Стр.СН, "Складская накладная");
//			AMS_ВызовСервера.ЗаписатьСобытиеДокумента(МассивОбъектов[0], ПредопределенноеЗначение("Перечисление.AMS_СобытияРеализации.ПечатьСН"));		
//
//			// Заявка перевозчику из Реализация			
//			Если СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу") Тогда
//				ТабличныйДокумент = ЗаявкаПеревозчику(МассивОбъектов);
//				ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//				Распечатать(ТабличныеДокументы, СписокОбъектов, 1, "Заявка перевозчику");
//			КонецЕсли;
//		КонецЕсли;
//		
//		// Доверенность
//		Если СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу")
//			Или СпособДоставки = ПредопределенноеЗначение(
//			"Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки") Тогда
//
//			ТабличныйДокумент = Доверенность(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, 1, "Доверенность");
//		КонецЕсли;
//		
//		// Накладная на палеты
//		Если AMS_ВызовСервера.ВходитВСегмент(Стр.Партнер, ПолучитьСегментПечатьНакладнаяНаПалеты()) Тогда
//			ТабличныйДокумент = НакладнаяНаПалеты(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, 1, "НакладнаяНаПалеты");
//		КонецЕсли;
//
//		Если Стр.Счет > 0 Тогда
//			ТабличныйДокумент = Счет(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, Стр.Счет, "Счет на оплату");
//		КонецЕсли;
//
//		Если Стр.УПД > 0 Тогда
//			ТабличныйДокумент = УПД(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, Стр.УПД, "УПД");
//			AMS_ВызовСервера.ЗаписатьСобытиеДокумента(МассивОбъектов[0], ПредопределенноеЗначение("Перечисление.AMS_СобытияРеализации.ПечатьУПД"));
//		КонецЕсли;
//
//		Если Стр.ТОРГ12 > 0 Тогда
//			ТабличныйДокумент = ТОРГ12(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, Стр.ТОРГ12, "ТОРГ-12");
//			AMS_ВызовСервера.ЗаписатьСобытиеДокумента(МассивОбъектов[0], ПредопределенноеЗначение("Перечисление.AMS_СобытияРеализации.ПечатьТОРГ12"));
//		КонецЕсли;
//
//		Если Стр.СчетФактура > 0 Тогда
//			ТабличныйДокумент = СчетФактура(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, Стр.СчетФактура, "Счет-Фактура");
//		КонецЕсли;
//
//		Если Стр.ТТН > 0 Тогда
//			ТабличныйДокумент = ТТН(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, Стр.ТТН, "ТТН");
//		КонецЕсли;
//
//		Если Стр.АктОРасхождениях > 0 Тогда
//			ТабличныйДокумент = АктОРасхождениях(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, Стр.АктОРасхождениях, "Акт о расхождениях");
//		КонецЕсли;
//
//		Если Стр.Спецификация > 0 Тогда
//			ТабличныйДокумент = Спецификация(МассивОбъектов);
//			ТабличныеДокументы = ТабличныеДокументыДляПечати(ТабличныйДокумент);
//			Распечатать(ТабличныеДокументы, СписокОбъектов, Стр.Спецификация, "Спецификация");
//		КонецЕсли;
	КонецЦикла;

	Состояние();
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Для Каждого Стр Из ТаблицаДокументов Цикл
		Стр.Метка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	Для Каждого Стр Из ТаблицаДокументов Цикл
		Стр.Метка = Истина;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФорму()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛогистическийЛист", Параметры.ЛогистическийЛист);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ Лист
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|ГДЕ
	|	т.Ссылка = &ЛогистическийЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лист.Распоряжение КАК Реализация
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Лист КАК Лист
	|ГДЕ
	|	Лист.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реал.Ссылка
	|ИЗ
	|	Лист КАК Лист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|		ПО Лист.Распоряжение = Реал.ЗаказКлиента
	|ГДЕ
	|	Лист.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Документ КАК Документ,
	|	МАКСИМУМ(т.Период) КАК ДатаОтмены
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	РегистрСведений.AMS_ИсторияРеализации КАК т
	|ГДЕ
	|	т.Операция = ""Отмена печати""
	|	И т.Документ В
	|		(ВЫБРАТЬ
	|			док.Реализация КАК Реализация
	|		ИЗ
	|			док КАК док)
	|СГРУППИРОВАТЬ ПО
	|	т.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Документ КАК Документ,
	|	МАКСИМУМ(т.Период) КАК ДатаСН
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	РегистрСведений.AMS_ИсторияРеализации КАК т
	|ГДЕ
	|	т.Операция = ""Печать СН""
	|	И т.Документ В
	|		(ВЫБРАТЬ
	|			док.Реализация КАК Реализация
	|		ИЗ
	|			док КАК док)
	|СГРУППИРОВАТЬ ПО
	|	т.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Документ КАК Документ,
	|	МАКСИМУМ(т.Период) КАК ДатаУПД
	|ПОМЕСТИТЬ вт3
	|ИЗ
	|	РегистрСведений.AMS_ИсторияРеализации КАК т
	|ГДЕ
	|	т.Операция В (""Печать УПД"", ""Печать ТОРГ-12"")
	|	И т.Документ В
	|		(ВЫБРАТЬ
	|			док.Реализация КАК Реализация
	|		ИЗ
	|			док КАК док)
	|СГРУППИРОВАТЬ ПО
	|	т.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реал.Номер КАК Номер,
	|	Реал.Дата КАК Дата,
	|	Реал.Партнер КАК Партнер,
	|	Реал.СуммаДокумента КАК СуммаДокумента,
	|	Парт._КолЭкзАктОРасхождениях КАК АктОРасхождениях,
	|	Парт._КолЭкзСпецификация КАК Спецификация,
	|	Парт._КолЭкзСЧ КАК Счет,
	|	Парт._КолЭкзСФ КАК СчетФактура,
	|	Парт._КолЭкзТТН КАК ТТН,
	|	Парт._КолЭкзТОРГ12 КАК ТОРГ12,
	|	Парт._КолЭкзУПД КАК УПД,
	|	док.Реализация КАК Реализация,
	|	Реал.AMS_УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	ВЫБОР
	|		КОГДА вт1.ДатаОтмены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА вт2.ДатаСН ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА вт2.ДатаСН > вт1.ДатаОтмены
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	КОНЕЦ КАК ПечатьСН,
	|	ВЫБОР
	|		КОГДА вт1.ДатаОтмены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА вт3.ДатаУПД ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА вт3.ДатаУПД > вт1.ДатаОтмены
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	КОНЕЦ КАК ПечатьУПД,
	|	Парт.Наименование КАК Наименование
	|ПОМЕСТИТЬ вт4
	|ИЗ
	|	док КАК док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Парт
	|			ПО Реал.Партнер = Парт.Ссылка
	|		ПО док.Реализация = Реал.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт1 КАК вт1
	|		ПО док.Реализация = вт1.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт2 КАК вт2
	|		ПО док.Реализация = вт2.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт3 КАК вт3
	|		ПО док.Реализация = вт3.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА вт4.УтвержденаОтгрузка
	|			ТОГДА ВЫБОР
	|				КОГДА вт4.ПечатьСН
	|				И вт4.ПечатьУПД
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Метка,
	|	вт4.Номер КАК Номер,
	|	вт4.Дата КАК Дата,
	|	вт4.Партнер КАК Партнер,
	|	вт4.СуммаДокумента КАК СуммаДокумента,
	|	вт4.АктОРасхождениях КАК АктОРасхождениях,
	|	вт4.Спецификация КАК Спецификация,
	|	1 КАК СН,
	|	вт4.Счет КАК Счет,
	|	вт4.СчетФактура КАК СчетФактура,
	|	вт4.ТТН КАК ТТН,
	|	вт4.ТОРГ12 КАК ТОРГ12,
	|	ВЫБОР
	|		КОГДА вт4.ПечатьУПД
	|			ТОГДА 0
	|		ИНАЧЕ вт4.УПД
	|	КОНЕЦ КАК УПД,
	|	вт4.Реализация КАК Реализация,
	|	вт4.УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	вт4.ПечатьСН КАК ПечатьСН,
	|	вт4.ПечатьУПД КАК ПечатьУПД,
	|	вт4.Наименование КАК Наименование
	|ИЗ
	|	вт4 КАК вт4
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Номер";
	ТаблицаДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Отгрузка.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаДокументов.УтвержденаОтгрузка");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветТекстаКонтрагентаДействующего);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Отгрузка.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаДокументов.УтвержденаОтгрузка");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивности);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгрузкаМетка.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаДокументов.УтвержденаОтгрузка");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
КонецПроцедуры

#Область ПроцедурыПечати

&НаКлиенте
Процедура Распечатать(ТабличныеДокументы, МассивОбъектов, КоличествоЭкземпляров, НаименованиеДокумента)
	Для Экземпляр = 1 По КоличествоЭкземпляров Цикл
		УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ТабличныеДокументы, МассивОбъектов, Ложь, 1);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СкладскаяНакладная(МассивОбъектов)
	Возврат Обработки.AMS_Продажи.СформироватьПечатнуюФормуСН(МассивОбъектов, Новый СписокЗначений, Новый Структура);
КонецФункции

&НаСервере
Функция УПД(МассивОбъектов)
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);

	Возврат Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуУПД(СтруктураТипов, Новый СписокЗначений,
		Новый Структура("ТипПечати", "АМС"));
КонецФункции

&НаСервере
Функция ТОРГ12(МассивОбъектов)
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТипПечати", "АМС");
	ПараметрыПечати.Вставить("ВыводитьУслуги", Ложь);

	Возврат Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуТОРГ12(СтруктураТипов, Новый СписокЗначений,
		ПараметрыПечати);
КонецФункции

&НаСервере
Функция СчетФактура(МассивОбъектов)
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);

	Возврат Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуСчетФактура(СтруктураТипов, Новый СписокЗначений,
		Новый Структура("ПечатьВВалюте", Ложь));
КонецФункции

&НаСервере
Функция Счет(МассивОбъектов)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ТипПечати", "АМС");
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);

	Возврат Обработки.AMS_Продажи.СформироватьПечатнуюФормуСчетНаОплату(МассивОбъектов, Новый СписокЗначений,
		ПараметрыПечати);
КонецФункции

&НаСервере
Функция Доверенность(МассивОбъектов)
	Возврат Обработки.AMS_Продажи.СформироватьПечатнуюФормуДоверенность(МассивОбъектов, Новый СписокЗначений);
КонецФункции

&НаСервере
Функция НакладнаяНаПалеты(МассивОбъектов)
	Возврат Обработки.AMS_Продажи.СформироватьНакладнаяНаПалеты(МассивОбъектов);
КонецФункции

&НаСервере
Функция ТТН(МассивОбъектов)
	Возврат Обработки.AMS_Продажи.СформироватьПечатнуюФормуТТН(МассивОбъектов, Новый СписокЗначений, Новый Структура);
КонецФункции

&НаСервере
Функция Спецификация(МассивОбъектов)
	Возврат Обработки.ПечатьОбщихФорм.амсСформироватьПечатнуюФормуСпецификации(МассивОбъектов, Новый СписокЗначений,
		Новый Структура);
КонецФункции

&НаСервере
Функция АктОРасхождениях(МассивОбъектов)
	Возврат Обработки.ПечатьОбщихФорм.амсСформироватьПечатнуюФормуАктОРасхождениях(МассивОбъектов,
		Новый СписокЗначений, Новый Структура);
КонецФункции

&НаСервере
Функция ЗаявкаПеревозчику(МассивОбъектов)
	Возврат Обработки.AMS_Продажи.СформироватьЗаявкаПеревозчику(МассивОбъектов);
КонецФункции

&НаСервере
Функция ТабличныеДокументыДляПечати(ПечатнаяФорма)
	ТабличныеДокументы = Новый СписокЗначений;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(ПечатнаяФорма);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ПечатнаяФорма,
		"АвтоМасштаб,Вывод,ВысотаСтраницы,ДвусторонняяПечать,Защита,ИмяПринтера,КодЯзыкаМакета,КоличествоЭкземпляров,МасштабПечати,ОриентацияСтраницы,ПолеСверху,ПолеСлева,ПолеСнизу,ПолеСправа,РазборПоКопиям,РазмерКолонтитулаСверху,РазмерКолонтитулаСнизу,РазмерСтраницы,ТочностьПечати,ЧерноБелаяПечать,ШиринаСтраницы,ЭкземпляровНаСтранице");
	ТабличныйДокумент.КоличествоЭкземпляров = 1;
	ТабличныеДокументы.Добавить(ТабличныйДокумент);

	Возврат ТабличныеДокументы;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСегментПечатьНакладнаяНаПалеты()
	Возврат Справочники.СегментыПартнеров.НайтиПоКоду("01-00000234");
КонецФункции

#КонецОбласти

#КонецОбласти
